import classes from "./About3.module.scss"

const About3 = () => {
    return <div className={classes.BG}>
        <div className={classes.Container}>
            <div>
                <h2>Поддержка и взаимоуважение</h2>
               <p>«ЛЕНТА» — это атмосфера большой и дружной семьи. Мы сохраняем её, несмотря на стремительное расширение компании. Мы умеем ставить себя
                   на место коллег — именно поэтому сотрудники офиса в «ЛЕНТЕ» проходят стажировки в магазинах. И мы не нанимаем «случайных» людей — в нашей семье сотрудники работают долго и с удовольствием.</p>
            </div>
        </div>
    </div>;
}

export default About3;