const Stores = [
    {
        id: 1,
        label: "Гипермаркет",
        count: 12
    },
    {
        id: 2,
        label: "Супермаркеты",
        count: 12
    },
    {
        id: 3,
        label: "Распределительные центры",
        count: 12
    },
    {
        id: 4,
        label: "Департаменты дистрибуции и автохозяйства",
        count: 12
    },
    {
        id: 5,
        label: "Централизованные производства",
        count: 12
    }, {
        id: 10,
        label: "Гипермаркет",
        count: 12
    },
    {
        id: 6,
        label: "Супермаркеты",
        count: 12
    },
    {
        id: 7,
        label: "Распределительные центры",
        count: 12
    },
    {
        id: 8,
        label: "Департаменты дистрибуции и автохозяйства",
        count: 12
    },
    {
        id: 9,
        label: "Централизованные производства",
        count: 12
    },
]

export default Stores;